In [1]:
# import NumPy
import numpy as np

In [2]:
# create an array from a list
arr = np.array([17,-10,16.8,11])
print(arr)

[ 17.  -10.   16.8  11. ]

In [3]:
print(type(arr))

<class 'numpy.ndarray'>

In [4]:
print(arr.dtype)

float64

In [7]:
# create an np array of 25 numbers between -2 and -2
y = np.linspace(-2, -1, 25)
print(y)

[-2.         -1.95833333 -1.91666667 -1.875      -1.83333333 -1.79166667
 -1.75       -1.70833333 -1.66666667 -1.625      -1.58333333 -1.54166667
 -1.5        -1.45833333 -1.41666667 -1.375      -1.33333333 -1.29166667
 -1.25       -1.20833333 -1.16666667 -1.125      -1.08333333 -1.04166667
 -1.        ]

In [9]:
# create an arrange using np.arrange
rng = np.arange(0,51)
print(rng)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
 48 49 50]

In [10]:
# create an np arrrange with stepped values
evens = np.arange(0, 23, 2)
print(evens)

[ 0  2  4  6  8 10 12 14 16 18 20 22]

In [11]:
# convert list from np arrange
print(list(evens))

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22]

In [13]:
# Save two arrays as variables.
a = np.array([1,1,1,1]) 
b = np.array([2,2,2,2])
# operations of arrays.
print(a + b)
print(a - b)
print(a * b)
print(a / b)

[3 3 3 3]
[-1 -1 -1 -1]
[2 2 2 2]
[0.5 0.5 0.5 0.5]

In [14]:
# get absolute of np array
print(np.abs([-2, -7, 1]))

[2 7 1]

In [15]:
# accessing np array values by index
nums = np.arange(20, 30, .5) 
print(len(nums))

print(nums[1]) #<- get the second element

20
20.5

In [16]:
# filtering number from np array
large_nums = nums[nums > 26] 
print(large_nums)

[26.5 27.  27.5 28.  28.5 29.  29.5]

In [17]:
# create a 2d np array
mat = np.array([
[8, 2, 6, 8],
[4, 5, 7, 2],
[3, 9, 7, 1] ])
print(mat)

[[8 2 6 8]
 [4 5 7 2]
 [3 9 7 1]]

In [18]:
nrows, ncols = mat.shape 
print(nrows, ncols)

3 4

In [19]:
# extracted the 2nd row/4th column (index at 0)
print(mat[1, 3])

2

In [20]:
# extract the 1st row and all columns (colon)
print(mat[0, :])

[8 2 6 8]

In [21]:
# extract the 2nd-3rd rows, 2nd/3rd columns
print(mat[1:3, 2:3])

[[7]
 [7]]

In [22]:
# import panda library
import pandas as pd

In [24]:
#import os
import os

In [33]:
# Set `main_dir` to the location of your `af-werx` folder (for Mac).
main_dir = '/Users/datasociety/Desktop/af-werx'

In [34]:
# Make `data_dir` from the `main_dir` and 
# remainder of the path to data directory. 
data_dir = main_dir + "/data"

In [36]:
# Check working directory.
print(os.getcwd())

/Users/datasociety/Desktop/af-werx/data

In [35]:
# Set working directory.
os.chdir(data_dir)

In [37]:
# create series (numpy array for panda)
num_series = pd.Series([45, 89, 67, 33])
print(num_series)

0    45
1    89
2    67
3    33
dtype: int64

In [38]:
# extract valus 
print(num_series.values)

[45 89 67 33]

In [39]:
# create a date range Go in intervals of month.
print(pd.date_range(start = '20170101', end = '20170331', freq = 'M'))

DatetimeIndex(['2017-01-31', '2017-02-28', '2017-03-31'], dtype='datetime64[ns]', freq='M')

In [40]:
# Not specifying end, but instead the start, freq, and how many periods.
print(pd.date_range(start = '20170101', freq = 'M', periods = 4))

DatetimeIndex(['2017-01-31', '2017-02-28', '2017-03-31', '2017-04-30'], dtype='datetime64[ns]', freq='M')

In [41]:
# create an hourly series

print(pd.date_range(start = '20170101', end = '20170102', freq = 'H'))

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-01 01:00:00',
               '2017-01-01 02:00:00', '2017-01-01 03:00:00',
               '2017-01-01 04:00:00', '2017-01-01 05:00:00',
               '2017-01-01 06:00:00', '2017-01-01 07:00:00',
               '2017-01-01 08:00:00', '2017-01-01 09:00:00',
               '2017-01-01 10:00:00', '2017-01-01 11:00:00',
               '2017-01-01 12:00:00', '2017-01-01 13:00:00',
               '2017-01-01 14:00:00', '2017-01-01 15:00:00',
               '2017-01-01 16:00:00', '2017-01-01 17:00:00',
               '2017-01-01 18:00:00', '2017-01-01 19:00:00',
               '2017-01-01 20:00:00', '2017-01-01 21:00:00',
               '2017-01-01 22:00:00', '2017-01-01 23:00:00',
               '2017-01-02 00:00:00'],
              dtype='datetime64[ns]', freq='H')

In [44]:
# create a series 5,10,15 in order
norm_series = pd.Series(np.arange(5, 20, 5)) 
print(norm_series)

0     5
1    10
2    15
dtype: int64

In [46]:
# get number of rows and colums
print(norm_series.shape)

(3,)

In [47]:
# Get mean
print(norm_series.mean())

10.0

In [48]:
# get median
print(norm_series.median())

10.0

In [49]:
# get std deviation
print(norm_series.std())

5.0

In [50]:
# Show only unique values.
print(norm_series.unique())

[ 5 10 15]

In [51]:
 # Show number of unique values.
print(norm_series.nunique())

3

In [52]:
 # Show counts of unique values.
print(norm_series.value_counts())

15    1
10    1
5     1
dtype: int64

In [53]:
 # Position of the min value.
print(norm_series.idxmin())

0

In [54]:
# Position of the max value.
print(norm_series.idxmax())

2

In [55]:
 # Ranks from smallest to largest.
print(norm_series.rank())

0    1.0
1    2.0
2    3.0
dtype: float64

In [56]:
   # Ranks from largest to smallest.
print(norm_series.rank(ascending = False))

0    3.0
1    2.0
2    1.0
dtype: float64

In [57]:
# Sorts values.
print(norm_series.sort_values())

0     5
1    10
2    15
dtype: int64

In [58]:
# Returns a series that is the cumulative sum of `norm_series`.
print(norm_series.cumsum())

0     5
1    15
2    30
dtype: int64

In [59]:
# Series 1 - times:
times = pd.date_range(start = '20170101', end = '20170630', freq = 'M')
# Series 2 - days out of the office:
days = pd.Series([2, 2, 6, 6, 2, 3])

In [60]:
# Create a dataframe from the two series we just created, as a dictionary.
average_ooo = pd.DataFrame({'Timestamp': times, 'OOO': days})
# View the first few rows of the dataframe, using the pandas function `.head()`.
print(average_ooo.head())

   Timestamp  OOO
0 2017-01-31    2
1 2017-02-28    2
2 2017-03-31    6
3 2017-04-30    6
4 2017-05-31    2

In [61]:
# Look up the type of object.
print(type(average_ooo))

<class 'pandas.core.frame.DataFrame'>

In [62]:
# Look up its shape.
print(average_ooo.shape)

(6, 2)

In [65]:
# get preview of metrics of dataframe
print(average_ooo.columns)

Index(['Timestamp', 'OOO'], dtype='object')

In [66]:
# get metric of dataframe info
print(average_ooo.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Timestamp    6 non-null datetime64[ns]
OOO          6 non-null int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes
None

In [67]:
# get summary in panda of dataframe
print(average_ooo.describe())

            OOO
count  6.000000
mean   3.500000
std    1.974842
min    2.000000
25%    2.000000
50%    2.500000
75%    5.250000
max    6.000000

In [68]:
# extract data by coloumn
print(average_ooo['Timestamp'])

0   2017-01-31
1   2017-02-28
2   2017-03-31
3   2017-04-30
4   2017-05-31
5   2017-06-30
Name: Timestamp, dtype: datetime64[ns]

In [69]:
# multiple columns...
print(average_ooo[['Timestamp', 'OOO']])

   Timestamp  OOO
0 2017-01-31    2
1 2017-02-28    2
2 2017-03-31    6
3 2017-04-30    6
4 2017-05-31    2
5 2017-06-30    3

In [70]:
# get values by row using .iloc index
june_ooo = average_ooo.iloc[5, :] 
print(june_ooo)

Timestamp    2017-06-30 00:00:00
OOO                            3
Name: 5, dtype: object

In [71]:
# another version of the same
june_ooo = average_ooo.iloc[5] 
print(june_ooo)

Timestamp    2017-06-30 00:00:00
OOO                            3
Name: 5, dtype: object

In [72]:
# use the `Timestamp` column as our new index using set_index
average_ooo = average_ooo.set_index('Timestamp') 
print(average_ooo)

            OOO
Timestamp
2017-01-31    2
2017-02-28    2
2017-03-31    6
2017-04-30    6
2017-05-31    2
2017-06-30    3

In [74]:
# get the index of a panda frame
print(average_ooo.index)

DatetimeIndex(['2017-01-31', '2017-02-28', '2017-03-31', '2017-04-30',
               '2017-05-31', '2017-06-30'],
              dtype='datetime64[ns]', name='Timestamp', freq=None)

In [75]:
# Look up a specific row by index.
print(average_ooo.loc['2017-02-28'])

OOO    2
Name: 2017-02-28 00:00:00, dtype: int64

In [76]:
# get value via index number
print(average_ooo.iloc[1])

OOO    2
Name: 2017-02-28 00:00:00, dtype: int64

In [77]:
# reset index value
average_ooo = average_ooo.reset_index() 
print(average_ooo.index)
print(average_ooo)

RangeIndex(start=0, stop=6, step=1)
   Timestamp  OOO
0 2017-01-31    2
1 2017-02-28    2
2 2017-03-31    6
3 2017-04-30    6
4 2017-05-31    2
5 2017-06-30    3

In [87]:
# read csv using panda 
household_poverty = pd.read_csv('household_poverty.csv')
household_poverty.head()

,male,hh_ID,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
0,1,21eb7fcc1,3,1,43,1,0,1,30,0,0,1,10,4
1,1,0e5d7a658,4,1,67,1,0,1,29,0,0,1,12,4
2,0,2c7317ea8,8,0,92,1,0,2,29,0,1,1,11,4
3,1,2b58d945f,5,2,17,4,2,3,31,0,0,1,9,4
4,0,2b58d945f,5,2,37,4,2,3,31,0,0,1,11,4

In [86]:
# get first 5 rows of data from csv
household_poverty.head()

,male,hh_ID,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
0,1,21eb7fcc1,3,1,43,1,0,1,30,0,0,1,10,4
1,1,0e5d7a658,4,1,67,1,0,1,29,0,0,1,12,4
2,0,2c7317ea8,8,0,92,1,0,2,29,0,1,1,11,4
3,1,2b58d945f,5,2,17,4,2,3,31,0,0,1,9,4
4,0,2b58d945f,5,2,37,4,2,3,31,0,0,1,11,4

In [85]:
# get first 3 rows using head
household_poverty.head(3)

,male,hh_ID,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
0,1,21eb7fcc1,3,1,43,1,0,1,30,0,0,1,10,4
1,1,0e5d7a658,4,1,67,1,0,1,29,0,0,1,12,4
2,0,2c7317ea8,8,0,92,1,0,2,29,0,1,1,11,4

In [84]:
# get a random sample of data specifying number
household_poverty.sample(n = 3)

,male,hh_ID,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
560,0,78711dc54,4,1,30,3,1,2,8,0,0,1,17,4
126,1,52123171a,7,2,42,4,0,4,24,0,0,1,17,4
815,1,573526e69,3,2,7,4,3,2,24,0,0,1,0,1

In [83]:
# get random by percentage
household_poverty.sample(frac = .02)

,male,hh_ID,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
445,0,4476ccd4c,10,5,28,11,4,6,15,0,0,1,7,4
158,0,347058ce6,5,2,29,5,3,3,18,0,0,1,11,1
34,1,cb6bb28dd,5,4,30,5,1,3,4,0,0,1,6,4
667,1,3f6eb55ad,2,1,44,2,0,1,31,0,0,1,11,2
334,0,2e50f3926,6,0,60,2,0,5,31,0,0,1,17,4
713,1,9f313f493,8,3,28,7,2,4,7,1,0,1,6,4
402,0,17498cd7c,5,2,15,4,2,3,31,1,0,1,9,4
693,0,cd0157ab9,5,2,90,4,0,3,31,0,1,1,2,4
851,0,a382bbff2,5,0,68,1,0,2,29,0,0,1,15,4
593,0,778919bcb,4,2,54,3,0,2,30,0,0,1,6,4
60,1,e2f9717d3,3,1,29,2,0,1,30,0,0,1,6,4
656,1,17f5db873,11,1,24,1,0,8,30,0,0,1,11,4
164,1,28ec0c747,7,2,27,7,1,5,7,0,0,1,11,4
825,1,9c7f9fa85,5,3,33,5,1,3,10,0,0,1,11,4
170,0,71bec40bc,3,3,4,7,3,2,12,0,0,1,0,2
387,0,5463ebd0e,5,0,87,1,0,2,29,0,0,1,19,4
350,1,01ff6a086,5,1,65,2,0,2,29,0,0,1,5,4
307,1,252a57c2d,5,2,40,4,1,3,6,0,0,1,3,4
688,0,c80a8d026,7,1,22,4,0,4,30,1,0,1,11,4
22,0,ec0e8edce,3,1,66,2,0,1,29,0,0,1,16,4

In [88]:
# get dataframe columns
household_poverty.columns

Index(['male', 'hh_ID', 'rooms', 'males_tot', 'age', 'ppl_total', 'num_child',
       'bedrooms', 'dependency_rate', 'computer', 'disabled_ppl',
       'water_inside', 'years_of_schooling', 'Target'],
      dtype='object')

In [89]:
# get data types in dataframes
household_poverty.dtypes

male                   int64
hh_ID                 object
rooms                  int64
males_tot              int64
age                    int64
ppl_total              int64
num_child              int64
bedrooms               int64
dependency_rate        int64
computer               int64
disabled_ppl           int64
water_inside           int64
years_of_schooling     int64
Target                 int64
dtype: object

In [90]:
# get field info
household_poverty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
male                  1000 non-null int64
hh_ID                 1000 non-null object
rooms                 1000 non-null int64
males_tot             1000 non-null int64
age                   1000 non-null int64
ppl_total             1000 non-null int64
num_child             1000 non-null int64
bedrooms              1000 non-null int64
dependency_rate       1000 non-null int64
computer              1000 non-null int64
disabled_ppl          1000 non-null int64
water_inside          1000 non-null int64
years_of_schooling    1000 non-null int64
Target                1000 non-null int64
dtypes: int64(13), object(1)
memory usage: 109.5+ KB

In [91]:
# get summary of dataframe
household_poverty.describe()

,male,rooms,males_tot,age,ppl_total,num_child,bedrooms,dependency_rate,computer,disabled_ppl,water_inside,years_of_schooling,Target
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,0.477000,5.244000,1.879000,35.936000,3.910000,1.243000,2.85500,20.503000,0.168000,0.048000,0.989000,8.055000,3.586000
std,0.499721,1.692728,1.236887,21.932783,1.819123,1.194729,1.08312,10.405781,0.374053,0.213873,0.104355,4.898568,0.833846
min,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,1.00000,2.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,0.000000,4.000000,1.000000,18.000000,3.000000,0.000000,2.00000,8.000000,0.000000,0.000000,1.000000,5.000000,4.000000
50%,0.000000,5.000000,2.000000,34.000000,4.000000,1.000000,3.00000,24.000000,0.000000,0.000000,1.000000,8.000000,4.000000
75%,1.000000,6.000000,2.000000,53.000000,5.000000,2.000000,3.00000,30.000000,0.000000,0.000000,1.000000,11.000000,4.000000
max,1.000000,11.000000,8.000000,97.000000,11.000000,5.000000,8.00000,31.000000,1.000000,1.000000,1.000000,21.000000,4.000000

In [93]:
# get index of dataframe
household_poverty.index

RangeIndex(start=0, stop=1000, step=1)

In [94]:
# change index of dataframe
household_poverty = household_poverty.set_index('hh_ID') 
print(household_poverty.index)

Index(['21eb7fcc1', '0e5d7a658', '2c7317ea8', '2b58d945f', '2b58d945f',
       '2b58d945f', '2b58d945f', 'd6dae86b7', 'd6dae86b7', 'd6dae86b7',
       ...
       'f54bc4b11', 'f54bc4b11', 'f54bc4b11', 'f54bc4b11', '34bab1f1f',
       '34bab1f1f', '34bab1f1f', '34bab1f1f', '34bab1f1f', '52cf8fe9d'],
      dtype='object', name='hh_ID', length=1000)

In [95]:
# Look up a specific row by index.
print(household_poverty.loc['21eb7fcc1'])

male                   1
rooms                  3
males_tot              1
age                   43
ppl_total              1
num_child              0
bedrooms               1
dependency_rate       30
computer               0
disabled_ppl           0
water_inside           1
years_of_schooling    10
Target                 4
Name: 21eb7fcc1, dtype: int64

In [96]:
# Look up a specific row by index.
print(household_poverty.iloc[1])

male                   1
rooms                  4
males_tot              1
age                   67
ppl_total              1
num_child              0
bedrooms               1
dependency_rate       29
computer               0
disabled_ppl           0
water_inside           1
years_of_schooling    12
Target                 4
Name: 0e5d7a658, dtype: int64

In [97]:
# reset index
household_poverty = household_poverty.reset_index()

In [98]:
# using groupby function in panda
grouped = household_poverty.groupby('rooms') 
print(grouped.first())

           hh_ID  male  males_tot  age  ppl_total  num_child  bedrooms  \
rooms
1      3e16fab89     1          2   41          3          0         1
2      d6dae86b7     0          1    7          4          2         1
3      21eb7fcc1     1          1   43          1          0         1
4      0e5d7a658     1          1   67          1          0         1
5      2b58d945f     1          2   17          4          2         3
6      65d20b573     0          2   55          3          0         3
7      bcc196e5a     0          1   60          3          0         4
8      2c7317ea8     0          0   92          1          0         2
9      6f1edad4e     1          3   58          4          0         5
10     bdd842cfd     1          2   19          6          2         6
11     b64f4194f     1          1   48          2          0         8

       dependency_rate  computer  disabled_ppl  water_inside  \
rooms
1                   30         0             0             0
2                   31         0             0             1
3                   30         0             0             1
4                   29         0             0             1
5                   31         0             0             1
6                    8         1             0             1
7                   30         1             0             1
8                   29         0             1             1
9                   31         0             0             1
10                   8         1             0             1
11                  30         0             1             1

       years_of_schooling  Target
rooms
1                       6       4
2                       0       4
3                      10       4
4                      12       4
5                       9       4
6                      14       4
7                      13       4
8                      11       4
9                      13       4
10                     11       4
11                      9       4

In [99]:
# count the number of hh_IDs by number of rooms, and creating a dataframe.
hh_ID = grouped.count()[['hh_ID']]
print(hh_ID)

       hh_ID
rooms
1          8
2         19
3         90
4        227
5        291
6        156
7        112
8         59
9         14
10        17
11         7

In [100]:
# This syntax would do the same, but create a series.
print(grouped.count().hh_ID)

rooms
1       8
2      19
3      90
4     227
5     291
6     156
7     112
8      59
9      14
10     17
11      7
Name: hh_ID, dtype: int64

In [101]:
# sort values by column 'hh_ID' descending
print(hh_ID.sort_values(by = ['hh_ID'], ascending = [False]))

       hh_ID
rooms
5        291
4        227
6        156
7        112
3         90
8         59
2         19
10        17
9         14
1          8
11         7

In [102]:
# filter using .query function
print(hh_ID.query('rooms < 5'))

       hh_ID
rooms
1          8
2         19
3         90
4        227

In [103]:
# add new boolean column after condition check
over100_hh = hh_ID['hh_ID'] > 100 
# Add the new column. 
hh_ID['over100_hh'] = over100_hh 
print(hh_ID.head())

       hh_ID  over100_hh
rooms
1          8       False
2         19       False
3         90       False
4        227        True
5        291        True